import { Grid, GridItem, Stack, Text, VStack } from "@chakra-ui/react";
import { title } from "process";

const infoData = [
  {
    icon: (
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
      >
        <path
          d="M14 3V7C14 7.26522 14.1054 7.51957 14.2929 7.70711C14.4804 7.89464 14.7348 8 15 8H19M14 3H7C6.46957 3 5.96086 3.21071 5.58579 3.58579C5.21071 3.96086 5 4.46957 5 5V19C5 19.5304 5.21071 20.0391 5.58579 20.4142C5.96086 20.7893 6.46957 21 7 21H17C17.5304 21 18.0391 20.7893 18.4142 20.4142C18.7893 20.0391 19 19.5304 19 19V8M14 3L19 8M9 12C9 12.1326 9.05268 12.2598 9.14645 12.3536C9.24021 12.4473 9.36739 12.5 9.5 12.5C9.63261 12.5 9.75979 12.4473 9.85355 12.3536C9.94732 12.2598 10 12.1326 10 12V11C10 10.8674 9.94732 10.7402 9.85355 10.6464C9.75979 10.5527 9.63261 10.5 9.5 10.5C9.36739 10.5 9.24021 10.5527 9.14645 10.6464C9.05268 10.7402 9 10.8674 9 11V12ZM9 12C9 13.3261 9.52678 14.5979 10.4645 15.5355C11.4021 16.4732 12.6739 17 14 17M14 17H15C15.1326 17 15.2598 16.9473 15.3536 16.8536C15.4473 16.7598 15.5 16.6326 15.5 16.5C15.5 16.3674 15.4473 16.2402 15.3536 16.1464C15.2598 16.0527 15.1326 16 15 16H14C13.8674 16 13.7402 16.0527 13.6464 16.1464C13.5527 16.2402 13.5 16.3674 13.5 16.5C13.5 16.6326 13.5527 16.7598 13.6464 16.8536C13.7402 16.9473 13.8674 17 14 17Z"
          stroke="#F75B00"
          strokeWidth="1.5"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
      </svg>
    ),
    title: "Холбоо барих",
    description:
      "Сэлбэгийн дэлгэрэнгүй мэдээллийг 72003003 лавлах дугаараас авна.",
  },
  {
    icon: (
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
      >
        <path
          d="M9 14L5 10M5 10L9 6M5 10H16C17.0609 10 18.0783 10.4214 18.8284 11.1716C19.5786 11.9217 20 12.9391 20 14C20 15.0609 19.5786 16.0783 18.8284 16.8284C18.0783 17.5786 17.0609 18 16 18H15"
          stroke="#F75B00"
          strokeWidth="1.5"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
      </svg>
    ),
    title: "Буцаалт",
    description: "48-72 цагийн дотор буцаалт хийх боломжтой.",
  },
  {
    icon: (
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
      >
        <path
          d="M5 17C5 17.5304 5.21071 18.0391 5.58579 18.4142C5.96086 18.7893 6.46957 19 7 19C7.53043 19 8.03914 18.7893 8.41421 18.4142C8.78929 18.0391 9 17.5304 9 17M5 17C5 16.4696 5.21071 15.9609 5.58579 15.5858C5.96086 15.2107 6.46957 15 7 15C7.53043 15 8.03914 15.2107 8.41421 15.5858C8.78929 15.9609 9 16.4696 9 17M5 17H3V13M9 17H15M15 17C15 17.5304 15.2107 18.0391 15.5858 18.4142C15.9609 18.7893 16.4696 19 17 19C17.5304 19 18.0391 18.7893 18.4142 18.4142C18.7893 18.0391 19 17.5304 19 17M15 17C15 16.4696 15.2107 15.9609 15.5858 15.5858C15.9609 15.2107 16.4696 15 17 15C17.5304 15 18.0391 15.2107 18.4142 15.5858C18.7893 15.9609 19 16.4696 19 17M19 17H21V11M2 5H13V17M21 11H13M21 11L18 6H13M3 9H7"
          stroke="#F75B00"
          strokeWidth="1.5"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
      </svg>
    ),
    title: "Хүргэлт",
    description:
      "Улаанбаатар дотор болон орон нутагруу энгийн хүргэлт 24-48 цаг, шуурхай хүргэлт 2-5 цагт хийгдэнэ.",
  },
  {
    icon: (
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
      >
        <path
          d="M9.5 3H14.5C14.8978 3 15.2794 3.15804 15.5607 3.43934C15.842 3.72064 16 4.10218 16 4.5C16 5.42826 15.6313 6.3185 14.9749 6.97487C14.3185 7.63125 13.4283 8 12.5 8H11.5C10.5717 8 9.6815 7.63125 9.02513 6.97487C8.36875 6.3185 8 5.42826 8 4.5C8 4.10218 8.15804 3.72064 8.43934 3.43934C8.72064 3.15804 9.10218 3 9.5 3Z"
          stroke="#F75B00"
          strokeWidth="1.5"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
        <path
          d="M4 17V16C4 13.8783 4.84285 11.8434 6.34315 10.3431C7.84344 8.84285 9.87827 8 12 8C14.1217 8 16.1566 8.84285 17.6569 10.3431C19.1571 11.8434 20 13.8783 20 16V17C20 18.0609 19.5786 19.0783 18.8284 19.8284C18.0783 20.5786 17.0609 21 16 21H8C6.93913 21 5.92172 20.5786 5.17157 19.8284C4.42143 19.0783 4 18.0609 4 17Z"
          stroke="#F75B00"
          strokeWidth="1.5"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
      </svg>
    ),
    title: "Төлбөр",
    description:
      "Та бүх банкаар төлбөрөө төлөх, мөн StorePay болон PocketZero ашиглан төлбөрөө хувааж төлөх боломжтой.",
  },
];

export const Info = () => {
  return (
    <Grid
      w="full"
      templateColumns={{
        base: "repeat(1, 1fr)",
        sm: "repeat(1, 1fr)",
        md: "repeat(2, 1fr)",
        lg: "repeat(2, 1fr)",
        xl: "repeat(4, 1fr)",
      }}
      gap={8}
    >
      {infoData.map((item, index) => (
        <GridItem key={index}>
          <VStack
            bg="#F9FAFB"
            p={4}
            gap={4}
            borderRadius={8}
            border="1px solid #E4E7EC"
            align="flex-start"
          >
            <Stack p={1} bg="#F75B001A" borderRadius={32}>
              {item.icon}
            </Stack>
            <VStack gap={2} h={"120px"} align="flex-start">
              <Text fontWeight={600}>{item.title}</Text>
              <Text fontSize={14}>{item.description}</Text>
            </VStack>
          </VStack>
        </GridItem>
      ))}
    </Grid>
  );
};
